In [1]:
#Add/Remove Rows and Columns From DataFrames

In [6]:
people={"first":["Corey","Jane","John"],
        "last":["Schafer","Doe","Doe"],
        "email":["CoreyMSchafer@gmail.com","JaneDoe@email.com","JohnDoe@email.com"]}

In [7]:
import pandas as pd

In [40]:
df=pd.DataFrame(people)

In [9]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [10]:
df['first']+' '+df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [11]:
df['full_name']=df['first']+' '+df['last']

In [12]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [15]:
df.drop(columns=['first','last'],inplace=True)

In [16]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [18]:
df[['full_name','email']]

       full_name                    email
0  Corey Schafer  CoreyMSchafer@gmail.com
1       Jane Doe        JaneDoe@email.com
2       John Doe        JohnDoe@email.com

In [21]:
df['full_name'].str.split(' ',expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [23]:
df[['first','last']]=df['full_name'].str.split(' ',expand=True)

In [24]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [26]:
df.append({'first' : 'Tony'},ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [28]:
people={"first":["Tony","Steve"],
        "last":["Stark","Rogers"],
        "email":["IronMan@avenge.com","Cap@avenge.com"]}
df2=pd.DataFrame(people)

In [29]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [33]:
df=df.append(df2,ignore_index=True)

In [34]:
df

                     email  first      full_name     last
0  CoreyMSchafer@gmail.com  Corey  Corey Schafer  Schafer
1        JaneDoe@email.com   Jane       Jane Doe      Doe
2        JohnDoe@email.com   John       John Doe      Doe
3       IronMan@avenge.com   Tony            NaN    Stark
4           Cap@avenge.com  Steve            NaN   Rogers

In [35]:
df.drop(index=4)

                     email  first      full_name     last
0  CoreyMSchafer@gmail.com  Corey  Corey Schafer  Schafer
1        JaneDoe@email.com   Jane       Jane Doe      Doe
2        JohnDoe@email.com   John       John Doe      Doe
3       IronMan@avenge.com   Tony            NaN    Stark

In [39]:
filt=df['last']=='Doe'
df.drop(index=df[filt].index)

                     email  first      full_name     last
0  CoreyMSchafer@gmail.com  Corey  Corey Schafer  Schafer
3       IronMan@avenge.com   Tony            NaN    Stark
4           Cap@avenge.com  Steve            NaN   Rogers